### Referneces

- https://towardsdatascience.com/all-about-categorical-variable-encoding-305f3361fd02
- https://github.com/FeatureLabs/categorical_encoding/blob/master/guides/notebooks/categorical-encoding-guide.ipynb

In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

## One Hot Encoding

In [3]:
pd.get_dummies(df).head()

    User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0  15624510   19            19000          0              0            1
1  15810944   35            20000          0              0            1
2  15668575   26            43000          0              1            0
3  15603246   27            57000          0              1            0
4  15804002   19            76000          0              0            1

In [4]:
pd.get_dummies(df, columns=['Gender','Purchased']).head()

,User ID,Age,EstimatedSalary,Gender_Female,Gender_Male,Purchased_0,Purchased_1
0,15624510,19,19000,0,1,1,0
1,15810944,35,20000,0,1,1,0
2,15668575,26,43000,1,0,1,0
3,15603246,27,57000,1,0,1,0
4,15804002,19,76000,0,1,1,0

In [5]:
# one hot encoding
pd.get_dummies(df, columns=['Gender','Purchased'], prefix=['Gen','Pur']).head()

    User ID  Age  EstimatedSalary  Gen_Female  Gen_Male  Pur_0  Pur_1
0  15624510   19            19000           0         1      1      0
1  15810944   35            20000           0         1      1      0
2  15668575   26            43000           1         0      1      0
3  15603246   27            57000           1         0      1      0
4  15804002   19            76000           0         1      1      0

In [6]:
# obtaining k-1 labels
pd.get_dummies(df, drop_first=True, columns=['Gender','Purchased']).head()

    User ID  Age  EstimatedSalary  Gender_Male  Purchased_1
0  15624510   19            19000            1            0
1  15810944   35            20000            1            0
2  15668575   26            43000            0            0
3  15603246   27            57000            0            0
4  15804002   19            76000            1            0

In [7]:
df = pd.read_csv('Data.csv')
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain   NaN  61000.0        No
4  Germany  40.0      NaN       Yes

In [8]:
# obtaining k-1 labels
pd.get_dummies(df, drop_first=True).head()

    Age   Salary  Country_Germany  Country_Spain  Purchased_Yes
0  44.0  72000.0                0              0              0
1  27.0  48000.0                0              1              1
2  30.0  54000.0                1              0              0
3   NaN  61000.0                0              1              0
4  40.0      NaN                1              0              1

In [9]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le = LabelEncoder()

In [12]:
le.fit(df['Purchased'])

LabelEncoder()

In [13]:
le.classes_

array(['No', 'Yes'], dtype=object)

In [14]:
df['Purchased'] = le.transform(df['Purchased'])

In [15]:
df['Purchased']

0    0
1    1
2    0
3    0
4    1
5    1
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int64

## Ordinal Encoding

In [18]:
cats = df['Country'].unique()
cats

array(['France', 'Spain', 'Germany'], dtype=object)

In [19]:
cats = list(df.groupby(['Country'])['Age'].mean().sort_values().index)
cats

['Spain', 'Germany', 'France']

In [21]:
ord_dict = {}
i=0
for cat in cats:
    ord_dict[cat] = i
    i = i+1
ord_dict

{'Spain': 0, 'Germany': 1, 'France': 2}

In [22]:
df['Country_ord'] = df['Country'].map(ord_dict)

In [23]:
df.head()

   Country   Age   Salary  Purchased  Country_ord
0   France  44.0  72000.0          0            2
1    Spain  27.0  48000.0          1            0
2  Germany  30.0  54000.0          0            1
3    Spain   NaN  61000.0          0            0
4  Germany  40.0      NaN          1            1

## Frequency Encoding

In [24]:
df.Country.value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [25]:
count_dict = df.Country.value_counts().to_dict()
count_dict

{'France': 4, 'Spain': 3, 'Germany': 3}

In [26]:
df['Country_count'] = df['Country'].map(count_dict)

In [27]:
df.head()

   Country   Age   Salary  Purchased  Country_ord  Country_count
0   France  44.0  72000.0          0            2              4
1    Spain  27.0  48000.0          1            0              3
2  Germany  30.0  54000.0          0            1              3
3    Spain   NaN  61000.0          0            0              3
4  Germany  40.0      NaN          1            1              3

## Probability Encoding

In [29]:
df

   Country   Age   Salary  Purchased  Country_ord  Country_count
0   France  44.0  72000.0          0            2              4
1    Spain  27.0  48000.0          1            0              3
2  Germany  30.0  54000.0          0            1              3
3    Spain   NaN  61000.0          0            0              3
4  Germany  40.0      NaN          1            1              3
5   France  35.0  58000.0          1            2              4
6    Spain   NaN  52000.0          0            0              3
7   France  48.0  79000.0          1            2              4
8  Germany  50.0  83000.0          0            1              3
9   France  37.0  67000.0          1            2              4

In [32]:
for k,v in df.groupby(['Country']):
    print(k)
    print(type(v))

France
<class 'pandas.core.frame.DataFrame'>
Germany
<class 'pandas.core.frame.DataFrame'>
Spain
<class 'pandas.core.frame.DataFrame'>

In [30]:
df.groupby(['Country'])['Purchased'].mean()

Country
France     0.750000
Germany    0.333333
Spain      0.333333
Name: Purchased, dtype: float64

In [33]:
prob_labels = df.groupby(['Country'])['Purchased'].mean().to_dict()
prob_labels

{'France': 0.75, 'Germany': 0.3333333333333333, 'Spain': 0.3333333333333333}

In [34]:
df['Purchase_Prob'] = df['Country'].map(prob_labels)
df.head()

,Country,Age,Salary,Purchased,Country_ord,Country_count,Purchase_Prob
0,France,44.0,72000.0,0,2,4,0.750000
1,Spain,27.0,48000.0,1,0,3,0.333333
2,Germany,30.0,54000.0,0,1,3,0.333333
3,Spain,NaN,61000.0,0,0,3,0.333333
4,Germany,40.0,NaN,1,1,3,0.333333

## Probability Ratio Encoding

In [35]:
prob_df = df.groupby(['Country'])['Purchased'].mean()
prob_df = pd.DataFrame(prob_df)
prob_df

         Purchased
Country
France    0.750000
Germany   0.333333
Spain     0.333333

In [36]:
# now let's  calculate the probability of target = 0 (people who did not purchase)
prob_df = df.groupby(['Country'])['Purchased'].mean()
prob_df = pd.DataFrame(prob_df)
prob_df['Not Purchased'] = 1-prob_df.Purchased
prob_df

         Purchased  Not Purchased
Country
France    0.750000       0.250000
Germany   0.333333       0.666667
Spain     0.333333       0.666667

In [37]:
prob_df['ratio'] = prob_df['Purchased']/prob_df['Not Purchased']
prob_df

         Purchased  Not Purchased  ratio
Country
France    0.750000       0.250000    3.0
Germany   0.333333       0.666667    0.5
Spain     0.333333       0.666667    0.5

In [38]:
prob_df['ratio'].to_dict()

{'France': 3.0, 'Germany': 0.49999999999999994, 'Spain': 0.49999999999999994}

In [40]:
odds_ratio_labels = prob_df['ratio'].to_dict()

In [41]:
df['Country_prob'] = df.Country.map(odds_ratio_labels)
df.head()

,Country,Age,Salary,Purchased,Country_ord,Country_count,Purchase_Prob,Country_prob
0,France,44.0,72000.0,0,2,4,0.750000,3.0
1,Spain,27.0,48000.0,1,0,3,0.333333,0.5
2,Germany,30.0,54000.0,0,1,3,0.333333,0.5
3,Spain,NaN,61000.0,0,0,3,0.333333,0.5
4,Germany,40.0,NaN,1,1,3,0.333333,0.5

## Weight Of Evidence Encoding

In [42]:
prob_df = df.groupby(['Country'])['Purchased'].mean()
prob_df = pd.DataFrame(prob_df)
prob_df

         Purchased
Country
France    0.750000
Germany   0.333333
Spain     0.333333

In [43]:
# now let's  calculate the probability of target = 0 (people who did not purchase)
prob_df = df.groupby(['Country'])['Purchased'].mean()
prob_df = pd.DataFrame(prob_df)
prob_df['Not Purchased'] = 1-prob_df.Purchased
prob_df

         Purchased  Not Purchased
Country
France    0.750000       0.250000
Germany   0.333333       0.666667
Spain     0.333333       0.666667

In [44]:
# since the log of zero is not defined
prob_df.loc[prob_df['Purchased'] == 0, 'Purchased'] = 0.00001
prob_df.loc[prob_df['Not Purchased'] == 0, 'Not Purchased'] = 0.00001
prob_df

         Purchased  Not Purchased
Country
France    0.750000       0.250000
Germany   0.333333       0.666667
Spain     0.333333       0.666667

In [46]:
prob_df['WoE'] = np.log(prob_df['Purchased']/prob_df['Not Purchased'])
prob_df

         Purchased  Not Purchased       WoE
Country
France    0.750000       0.250000  1.098612
Germany   0.333333       0.666667 -0.693147
Spain     0.333333       0.666667 -0.693147

In [48]:
woe_labels = prob_df['WoE'].to_dict()

In [49]:
df['Country_WOE'] = df.Country.map(woe_labels)
df.head()

,Country,Age,Salary,Purchased,Country_ord,Country_count,Purchase_Prob,Country_prob,Country_WOE
0,France,44.0,72000.0,0,2,4,0.750000,3.0,1.098612
1,Spain,27.0,48000.0,1,0,3,0.333333,0.5,-0.693147
2,Germany,30.0,54000.0,0,1,3,0.333333,0.5,-0.693147
3,Spain,NaN,61000.0,0,0,3,0.333333,0.5,-0.693147
4,Germany,40.0,NaN,1,1,3,0.333333,0.5,-0.693147

## LeaveOneOut Encoding

LeaveOneOut Encoding is identical to TargetEncoding except it handles Target Encoding's problems with overfitting/response leakage.

In LeaveOneOut Encoding, the row in question leaves its own value out when calculating the mean.

In [1]:
import categorical_encoding as ce

ModuleNotFoundError: No module named 'categorical_encoding'

In [ ]:

ce_leave = ce.Encoder(method='leave_one_out')
ce_leave.fit_transform(feature_matrix, features, feature_matrix['value'])

## Summary

The go-to categorical encoding method should be one-hot encoding in nearly every scenario, with the exception of decision-tree based algorithms. It is straightforward to apply and typically performs well.

However, in the cases where one-hot encoding leads to memory issues, it is sometimes necessary to look to other encoders. Ordinal, Binary, Hashing, and Target encoders are all possible alternatives, although each presents its own unique set of benefits and drawbacks.

Another go-to method should be LeaveOneOut Encoding. It solves the memory issues that One-Hot Encoding raises, does not have the same concerns over response leakage as Target Encoding, and performs well with very little drawback in almost every situation.

Finally, Contrast Encoders provide an interesting way to mathematically separate categories and determine patterns. However, there are many concerns with contrast encoders, chiefly with its resulting high dimensionality issues as well as its lack of universal performance.

All in all, categorical encoding is an essential step in feature engineering/machine learning, and picking the correct method can be challenging. However, you should always feel free to test multiple categorical encoding methods and pick the one that yields in the best performance--this guide serves as a starting point to pick the right one.